app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_username(login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "likuna2"], ["LIMIT", 1]]