app/controllers/clubs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def index
    #not all clubs, just the clubs that correspond to
    @user = User.find(params[:user_id])

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def read_one
    #not all clubs, just the clubs that correspond to
    # @user = User.find(user_params[:user_id])
    @club = Club.find(params[:club_id])

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "aaron"]]
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "clubs" ("google_id", "rules", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["google_id", "club"], ["rules", "params likuna"], ["created_at", "2020-04-08 16:10:42.508191"], ["updated_at", "2020-04-08 16:10:42.508191"]]
SELECT "users".* FROM "users" INNER JOIN "clubs_users" ON "users"."id" = "clubs_users"."user_id" WHERE "clubs_users"."club_id" = $1  [["club_id", 2]]
---
  def add_member
    #not all clubs, just the clubs that correspond to
    @user = User.where({username: member_params[:username]})
    @club = Club.find(params[:club_id])
    @club.users << @user

    render json: @club.users.map{ |n| n.frontend_data}

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "clubs_users" ON "users"."id" = "clubs_users"."user_id" WHERE "clubs_users"."club_id" = $1  [["club_id", 2]]
---
  def get_members
    @club = Club.find(params[:club_id])

    render json: @club.users.map{ |n| n.frontend_data}

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "clubs" ("google_id", "rules", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["google_id", "s4CKqxi6yWIC"], ["rules", "consider the fat tails"], ["created_at", "2020-04-09 19:37:42.964913"], ["updated_at", "2020-04-09 19:37:42.964913"], ["user_id", 3]]
---
  def create
    puts "create is running with #{club_params}"
    @club = Club.new(club_params)
    # user that is logged in
    @user = User.find(club_params[:user_id])
    # User.find(22)

    if @club.save

UPDATE "clubs" SET "google_id" = $1, "updated_at" = $2 WHERE "clubs"."id" = $3  [["google_id", "dasdsad"], ["updated_at", "2020-04-13 15:17:42.591608"], ["id", 10]]
---
  def update
    if @club.update(club_params)

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def add_user
    @club = Club.find(params[:club_id])

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_club
      @club = Club.find(params[:club_id])