app/controllers/comments_controller.rb

  def index
    @comments = Comment.where(club_id: params[:club_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."club_id" = $1  [["club_id", 2]]