app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."club_id" = $1  [["club_id", 2]]
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "user_id", "club_id", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "i am text"], ["created_at", "2020-04-09 02:57:31.930474"], ["updated_at", "2020-04-09 02:57:31.930474"], ["user_id", 1], ["club_id", 2], ["username", "likuna"]]
---
  def create
    @comment = Comment.new(
      text: 'i am text - bell jar',
      user: User.find(1),
      club: Club.find(params[:club_id]),
      username: 'likuna - bell jar'
      )

    if @comment.save