app/controllers/subcomments_controller.rb

SELECT "subcomments".* FROM "subcomments" WHERE "subcomments"."comment_id" = $1  [["comment_id", 43]]
---
   def index
    @subcomments = Subcomment.where(comment_id: params[:comment_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
INSERT INTO "subcomments" ("text", "user_id", "username", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "likuna"], ["user_id", 6], ["username", "mike"], ["comment_id", 43], ["created_at", "2020-05-05 23:01:23.790361"], ["updated_at", "2020-05-05 23:01:23.790361"]]
---
  def create
    # @subcomment = Subcomment.new(
    #   text: params[:text],
    #   user_id: params[:user_id],
    #   comment_id: params[:comment_id],
    #   username: params[:username]
    #   )

    @comment = Comment.find(params[:comment_id])
    @subcomment = @comment.subcomments.create(subcomment_params)