app/controllers/users_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    @clubs = Club.all

INSERT INTO "clubs" ("google_id", "rules", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["google_id", "Pn8d9riSL6UC"], ["rules", "don't be mean"], ["created_at", "2020-04-07 22:17:29.902098"], ["updated_at", "2020-04-07 22:17:29.902098"]]
---
  def add_club
    @club = Club.new(club_params)
    @user = User.find(@current_user.id)
    @user.clubs << @club

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show_clubs
    @user = User.find(params[:user_id])